#### Q1. 고객 속성(id, 성별, 연령, 거주지역) 데이터와 거래 데이터를 통합한 데이터 프레임 df를 생성하세요.

고객별 속성 데이터 

- id: 1번 ~ 100번 일련번호
- gender: 0, 1 정수, 난수 생성
- age: 10 ~ 80 사이 정수 난수를 생성하고 범주화하여 age_cat 파생
- region: 1 ~ 5 사이 난수 생성

거래 데이터 

- id: 1번 ~ 100번 일련번호 (관측치 1000개)
- product: 고급제품(hpd), 일반제품(ldp)로 구분
- price: 100 ~ 200 사이 정수 난수 생성
- qty: 1 ~ 2 사이 정수 난수 생성
- day: 요일
- date: 2020-01-01 ~ 2021-12-31 사이의 날짜 1000개 생성
- amount: price * qty 로 산출 

#### Q2. df를 수정하여 5가지 이상의 인사이트를 포함한 데이터 셋으로 변환하세요. 

#### Q3. df를 탐색적 분석을 통하여 인사이트를 도출하세요.

In [726]:
import numpy as np
import pandas as pd

pid = np.arange(1,101)
pid = pd.Series(pid)
gender = np.random.randint(2,size=100)
gender = pd.Series(gender)
age = np.random.randint(10,81,size=100)
age = pd.Series(age)
region = np.random.randint(6,size=100)
region = pd.Series(region)
df = pd.concat([pid,gender,age,region],axis=1)

df.columns = ['pid','gender','age','region']
df

    pid  gender  age  region
0     1       1   22       3
1     2       0   59       3
2     3       1   29       3
3     4       0   15       0
4     5       0   43       3
..  ...     ...  ...     ...
95   96       0   75       2
96   97       0   72       4
97   98       1   32       2
98   99       0   39       4
99  100       1   37       2

[100 rows x 4 columns]

In [727]:
def age_c(a):
    if a <= 20 : ac = 1
    elif a <= 30 : ac = 2
    elif a <= 40 : ac = 3
    elif a <= 50 : ac = 4
    elif a <= 60 : ac = 5
    else : ac = 6
    return ac

df['age_cat'] = df.age.apply(age_c)
df.drop(['age'],axis=1,inplace=True)
df.head()

   pid  gender  region  age_cat
0    1       1       3        2
1    2       0       3        5
2    3       1       3        2
3    4       0       0        1
4    5       0       3        4


거래 데이터 

- id: 1번 ~ 100번 일련번호 (관측치 1000개)
- product: 고급제품(hpd), 일반제품(ldp)로 구분
- price: 100 ~ 200 사이 정수 난수 생성
- qty: 1 ~ 2 사이 정수 난수 생성
- day: 요일
- date: 2020-01-01 ~ 2021-12-31 사이의 날짜 1000개 생성
- amount: price * qty 로 산출

In [728]:
zf = np.zeros((1000,6))
df2 = pd.DataFrame(zf,columns=['pid','product','price','qty','day','date'])
df2.head()

   pid  product  price  qty  day  date
0  0.0      0.0    0.0  0.0  0.0   0.0
1  0.0      0.0    0.0  0.0  0.0   0.0
2  0.0      0.0    0.0  0.0  0.0   0.0
3  0.0      0.0    0.0  0.0  0.0   0.0
4  0.0      0.0    0.0  0.0  0.0   0.0

In [729]:
df2['pid'] = np.random.randint(1,101,1000)
df2['product'] = np.random.randint(0,2,1000)
df2['price'] = np.random.randint(100,200,1000)
df2['qty'] = np.random.randint(1,3,1000)
df2['date'] = pd.date_range(start='2020-01-01',end='2021-12-31',periods=1000)
df2['day'] = df2['date'].dt.dayofweek
df2['year'] = df2['date'].dt.year
df2.drop(['date'],axis=1,inplace=True)
df2.head()

   pid  product  price  qty  day  year
0   53        0    181    1    2  2020
1   49        1    172    1    2  2020
2   30        1    197    1    3  2020
3   10        1    107    2    4  2020
4   56        0    153    1    4  2020

In [730]:
def ptransfer(product,price):
    if product == 0 :
        return price * 30
    else :
        return price * 10

def qtytransfer(product,qty):
    if product == 0 :
        return qty * 10
    else :
        return qty * 100

df2['price'] = df2.apply(lambda x: ptransfer(x['product'],x['price']),axis=1)
df2['qty'] = df2.apply(lambda x : qtytransfer(x['product'],x['qty']),axis=1)

df2

     pid  product  price  qty  day  year
0     53        0   5430   10    2  2020
1     49        1   1720  100    2  2020
2     30        1   1970  100    3  2020
3     10        1   1070  200    4  2020
4     56        0   4590   10    4  2020
..   ...      ...    ...  ...  ...   ...
995   27        1   1890  200    1  2021
996    1        0   4080   10    1  2021
997   71        1   1940  100    2  2021
998   30        1   1640  200    3  2021
999   89        1   1460  200    4  2021

[1000 rows x 6 columns]

In [731]:
df2['amount'] = df2['qty'] * df2['price']
df2

     pid  product  price  qty  day  year  amount
0     53        0   5430   10    2  2020   54300
1     49        1   1720  100    2  2020  172000
2     30        1   1970  100    3  2020  197000
3     10        1   1070  200    4  2020  214000
4     56        0   4590   10    4  2020   45900
..   ...      ...    ...  ...  ...   ...     ...
995   27        1   1890  200    1  2021  378000
996    1        0   4080   10    1  2021   40800
997   71        1   1940  100    2  2021  194000
998   30        1   1640  200    3  2021  328000
999   89        1   1460  200    4  2021  292000

[1000 rows x 7 columns]

In [732]:
pdf = df2.drop(['qty','price'],axis=1)
pdf.head()

   pid  product  day  year  amount
0   53        0    2  2020   54300
1   49        1    2  2020  172000
2   30        1    3  2020  197000
3   10        1    4  2020  214000
4   56        0    4  2020   45900

In [733]:
pdf.groupby(['product','year'])['amount'].sum()

product  year
0        2020    17077200
         2021    16580700
1        2020    54842000
         2021    57976000
Name: amount, dtype: int64

#### Q2. df를 수정하여 5가지 이상의 인사이트를 포함한 데이터 셋으로 변환하세요. 

- 2020년 코로나로 인한 생필품 판매량 급증(저가 제품 판매량 50% 증가)
- 2021년 코로나 악화로 인한 물량 납품량 감소 (저가 제품 재고 30% 감소)
- 2020년 창고 약탈 사건(고가 제품 재고 10% 도난)
- 2021년 반도체 부족으로 (고가 제품 납품 물량 감소)
- 2021년 장마 침수로 (전체 재고 30% 유실)

In [734]:
def covid_u(year,product,amount):
# 2020년 코로나로 인한 생필품 판매량 급증(저가 제품 판매량 50% 증가)
    if (year == 2020) & (product == 1):
        return amount + (amount * 0.5)
# 2021년 코로나 악화로 인한 전체 매출 감소(30%)
    elif year == 2021:
        return amount * 0.7
# 2020년 (2021년 물가 상승 예측으로 고가제품 사재기 현상)
    elif (year == 2020) & (product == 0):
        return amount + (amount * 0.8)
# 2021년 반도체 부족으로 (고가 제품 매출 감소)
    elif (year == 2021) & (product == 0):
        return amount * 0.3
# 2021년 장마 침수로 생필품 재고 대부분이 판매불가
    elif (year == 2021) & (product == 1):
        return amount * 0.2
    else :
        return amount

pdf['amount'] = pdf.apply(lambda x : covid_u(x['year'],x['product'],x['amount']),axis=1)
pdf.head()

   pid  product  day  year    amount
0   53        0    2  2020   97740.0
1   49        1    2  2020  258000.0
2   30        1    3  2020  295500.0
3   10        1    4  2020  321000.0
4   56        0    4  2020   82620.0

In [735]:
pdf.groupby(['product','year'])['amount'].sum()

product  year
0        2020    30738960.0
         2021    11606490.0
1        2020    82263000.0
         2021    40583200.0
Name: amount, dtype: float64

In [736]:
pdf['yp'] = pdf[['year','product']].astype(str).apply('_'.join,axis=1)
pdf.head()

   pid  product  day  year    amount      yp
0   53        0    2  2020   97740.0  2020_0
1   49        1    2  2020  258000.0  2020_1
2   30        1    3  2020  295500.0  2020_1
3   10        1    4  2020  321000.0  2020_1
4   56        0    4  2020   82620.0  2020_0

In [737]:
npdf = pd.pivot_table(pdf,index='pid',columns='yp',values='amount',aggfunc='sum')
npdf.head()

yp     2020_0     2020_1    2021_0    2021_1
pid
1    244620.0   868500.0  291690.0  345800.0
2    421740.0   625500.0  102480.0  724500.0
3    459540.0   807000.0   61320.0  121800.0
4    429300.0   897000.0  250740.0  121800.0
5     83700.0  1017000.0       NaN  124600.0

In [738]:
npdf['2020_0'].fillna(npdf['2020_0'].mean(),inplace=True)
npdf['2020_1'].fillna(npdf['2020_1'].mean(),inplace=True)
npdf['2021_0'].fillna(npdf['2021_0'].mean(),inplace=True)
npdf['2021_1'].fillna(npdf['2021_1'].mean(),inplace=True)
npdf.head()

yp     2020_0     2020_1         2021_0    2021_1
pid
1    244620.0   868500.0  291690.000000  345800.0
2    421740.0   625500.0  102480.000000  724500.0
3    459540.0   807000.0   61320.000000  121800.0
4    429300.0   897000.0  250740.000000  121800.0
5     83700.0  1017000.0  119654.536082  124600.0

In [739]:
npdf.columns.name = None
npdf.reset_index(inplace=True)
npdf.head()

   pid    2020_0     2020_1         2021_0    2021_1
0    1  244620.0   868500.0  291690.000000  345800.0
1    2  421740.0   625500.0  102480.000000  724500.0
2    3  459540.0   807000.0   61320.000000  121800.0
3    4  429300.0   897000.0  250740.000000  121800.0
4    5   83700.0  1017000.0  119654.536082  124600.0

In [740]:
npdf['2020_0'] = (npdf['2020_0'] / npdf['2020_0'].sum()) * 100
npdf['2020_1'] = (npdf['2020_1'] / npdf['2020_1'].sum()) * 100
npdf['2021_0'] = (npdf['2021_0'] / npdf['2021_0'].sum()) * 100
npdf['2021_1'] = (npdf['2021_1'] / npdf['2021_1'].sum()) * 100
npdf.head()

   pid    2020_0    2020_1    2021_0    2021_1
0    1  0.724176  0.960742  2.437768  0.758348
1    2  1.248524  0.691933  0.856466  1.588847
2    3  1.360428  0.892710  0.512475  0.267111
3    4  1.270905  0.992269  2.095533  0.267111
4    5  0.247787  1.125014  1.000000  0.273251

In [741]:
npdf['hp'] = (npdf['2021_0'] - npdf['2020_0']) / npdf['2020_0']
npdf['lp'] = (npdf['2021_1'] - npdf['2020_1']) / npdf['2020_1']
pdf2 = npdf[['pid','hp','lp']]
pdf2.head()

   pid        hp        lp
0    1  2.366264 -0.210664
1    2 -0.314018  1.296244
2    3 -0.623298 -0.700787
3    4  0.648851 -0.730808
4    5  3.035732 -0.757113

In [742]:
df = pd.merge(df,pdf2,on='pid',how='outer')
df.head()

   pid  gender  region  age_cat        hp        lp
0    1       1       3        2  2.366264 -0.210664
1    2       0       3        5 -0.314018  1.296244
2    3       1       3        2 -0.623298 -0.700787
3    4       0       0        1  0.648851 -0.730808
4    5       0       3        4  3.035732 -0.757113

In [743]:
df_y = pdf[['pid','year','amount']]
pvt = pd.pivot_table(df_y,index='pid',columns='year',values='amount',aggfunc='sum')
pvt = pvt.reset_index()
pvt.columns.name = None
pvt.isnull().sum()

pid     0
2020    1
2021    0
dtype: int64

In [744]:
pvt[2020].fillna(pvt[2020].mean(),inplace=True)
pvt[2021].fillna(pvt[2021].mean(),inplace=True)
pvt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pid     100 non-null    int64
 1   2020    100 non-null    float64
 2   2021    100 non-null    float64
dtypes: float64(2), int64(1)
memory usage: 2.5 KB

In [745]:
df = pd.merge(df,pvt,on='pid',how='outer')
df.head()

   pid  gender  region  age_cat        hp        lp       2020      2021
0    1       1       3        2  2.366264 -0.210664  1113120.0  637490.0
1    2       0       3        5 -0.314018  1.296244  1047240.0  826980.0
2    3       1       3        2 -0.623298 -0.700787  1266540.0  183120.0
3    4       0       0        1  0.648851 -0.730808  1326300.0  372540.0
4    5       0       3        4  3.035732 -0.757113  1100700.0  124600.0

In [746]:
df['ratio'] = (df[2021] - df[2020]) / df[2020]
df.head()

,pid,gender,region,age_cat,hp,lp,2020,2021,ratio
0,1,1,3,2,2.366264,-0.210664,1113120.0,637490.0,-0.427294
1,2,0,3,5,-0.314018,1.296244,1047240.0,826980.0,-0.210324
2,3,1,3,2,-0.623298,-0.700787,1266540.0,183120.0,-0.855417
3,4,0,0,1,0.648851,-0.730808,1326300.0,372540.0,-0.719113
4,5,0,3,4,3.035732,-0.757113,1100700.0,124600.0,-0.886799

In [747]:
df1 = df.drop([2020,2021],axis=1)
df1.head()

   pid  gender  region  age_cat        hp        lp     ratio
0    1       1       3        2  2.366264 -0.210664 -0.427294
1    2       0       3        5 -0.314018  1.296244 -0.210324
2    3       1       3        2 -0.623298 -0.700787 -0.855417
3    4       0       0        1  0.648851 -0.730808 -0.719113
4    5       0       3        4  3.035732 -0.757113 -0.886799

In [748]:
def mkla(a,b):
    if b >= a:
        return 1
    else : 
        return 0

df['target'] = df.apply(lambda x : mkla(x[2020],x[2021]),axis=1)
df.head()

,pid,gender,region,age_cat,hp,lp,2020,2021,ratio,target
0,1,1,3,2,2.366264,-0.210664,1113120.0,637490.0,-0.427294,0
1,2,0,3,5,-0.314018,1.296244,1047240.0,826980.0,-0.210324,0
2,3,1,3,2,-0.623298,-0.700787,1266540.0,183120.0,-0.855417,0
3,4,0,0,1,0.648851,-0.730808,1326300.0,372540.0,-0.719113,0
4,5,0,3,4,3.035732,-0.757113,1100700.0,124600.0,-0.886799,0

In [749]:
y = df['target']
x = df.drop(['pid',2020,2021,'ratio','target'],axis=1)

In [750]:
from sklearn import preprocessing
from sklearn.model_selection import train_test_split

# 독립변수, 종속변수 분리
y_t_df = y # 종속변수
X_t_df = x # 독립변수

# 독립변수 정규화
# X_t_df = preprocessing.StandardScaler().fit(X_t_df).transform(X_t_df)

# 학습용 데이터와 평가용 데이터를 8:2 혹은 7:3으로 분리
X_train, X_test, y_train, y_test = train_test_split(X_t_df, y_t_df, test_size = 0.2,
                                                   random_state =11)

print(X_train.shape)
print(X_test.shape)

(80, 5)
(20, 5)

In [751]:
# 모델 학습 및 평가
from sklearn.metrics import accuracy_score
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier

rf_model = RandomForestClassifier()
rf_model.fit(X_train, y_train)
rf_pred = rf_model.predict(X_test)
accuracy_rf = accuracy_score(y_test, rf_pred).round(2)

lr_model = LogisticRegression()
lr_model.fit(X_train,y_train)
lr_pred = lr_model.predict(X_test)
accuracy_lr = accuracy_score(y_test,lr_pred).round(2)

print('rf 정확도:{}, lr 정확도:{}'.format(accuracy_rf,accuracy_lr))

rf 정확도:0.9, lr 정확도:0.85

## Q. 타이타닉 생존자 예측모델 개발을 위한 Titanic 분석용 데이터셋

#### Titanic data 전처리
- 분석 데이터 : titanic3.csv
- 재사용 가능한 전처리 사용자 함수 작성 하여 전처리
    - Null 값 처리 : Age는 평균나이, 나머지 칼럼은 'N'값으로 변경
    - 불필요한 속성 칼럼 삭제
    - 문자열 칼럼 레이블 인코딩
- 통계적, 시각적 탐색을 통한 다양한 인사이트 도출
- 탐색적 분석을 통한 feature engineering, 파생변수 

#### 컬럼 정보

- survived : 생존여부(1: 생존, 0 : 사망)
- pclass : 승선권 클래스(1 : 1st, 2 : 2nd ,3 : 3rd)
- name : 승객 이름
- sex : 승객 성별
- age : 승객 나이
- sibsp : 동반한 형제자매, 배우자 수
- parch : 동반한 부모, 자식 수
- ticket : 티켓의 고유 넘버
- fare 티켓의 요금
- cabin : 객실 번호
- embarked : 승선한 항구명(C : Cherbourg, Q : Queenstown, S : Southampton)
- boat
- body
- home.dest

In [752]:
import pandas as pd
df = pd.read_csv('dataset/titanic3.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [753]:
df.drop(['name','ticket','boat','body','home.dest','cabin'],axis=1,inplace=True)

In [754]:
df = df.dropna(subset=['age'],how='any',axis=0) # age의 결측값 드랍
df.isnull().sum()

pclass      0
survived    0
sex         0
age         0
sibsp       0
parch       0
fare        1
embarked    2
dtype: int64

In [755]:
df['fare'].fillna(df['fare'].mean(),inplace=True)
df.isnull().sum()

pclass      0
survived    0
sex         0
age         0
sibsp       0
parch       0
fare        0
embarked    2
dtype: int64

In [756]:
most_em = df['embarked'].value_counts(dropna=True).idxmax()
df['embarked'].fillna(most_em,inplace=True)
df.isnull().sum()

pclass      0
survived    0
sex         0
age         0
sibsp       0
parch       0
fare        0
embarked    0
dtype: int64

In [757]:
df.head()

   pclass  survived     sex    age  sibsp  parch      fare embarked
0       1         1  female  29.00      0      0  211.3375        S
1       1         1    male   0.92      1      2  151.5500        S
2       1         0  female   2.00      1      2  151.5500        S
3       1         0    male  30.00      1      2  151.5500        S
4       1         0  female  25.00      1      2  151.5500        S

In [758]:
df.head()
def age_cat(a):
    if a <= 20 : cat = 1
    elif a <= 30 : cat = 2
    elif a <= 40 : cat = 3
    elif a <= 50 : cat = 4
    elif a <= 60 : cat = 5
    else : cat = 6
    return cat

def fare_cat(a):
    if a == 0 : result = 0
    elif a <= 10 : result = 1
    elif a <= 30 : result = 2
    elif a <= 60 : result = 3
    elif a <= 90 : result = 4
    else : result = 5
    return result

df['age_cat'] = df.age.apply(age_cat)
df['fare_cat'] = df.fare.apply(fare_cat)

df2 = df.drop(['fare','age','embarked'],axis=1)
df2

      pclass  survived     sex  sibsp  parch  age_cat  fare_cat
0          1         1  female      0      0        2         5
1          1         1    male      1      2        1         5
2          1         0  female      1      2        1         5
3          1         0    male      1      2        2         5
4          1         0  female      1      2        2         5
...      ...       ...     ...    ...    ...      ...       ...
1301       3         0    male      0      0        4         1
1304       3         0  female      1      0        1         2
1306       3         0    male      0      0        2         1
1307       3         0    male      0      0        2         1
1308       3         0    male      0      0        2         1

[1046 rows x 7 columns]

In [759]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df2['sex'] = le.fit_transform(df2['sex'])

df2

      pclass  survived  sex  sibsp  parch  age_cat  fare_cat
0          1         1    0      0      0        2         5
1          1         1    1      1      2        1         5
2          1         0    0      1      2        1         5
3          1         0    1      1      2        2         5
4          1         0    0      1      2        2         5
...      ...       ...  ...    ...    ...      ...       ...
1301       3         0    1      0      0        4         1
1304       3         0    0      1      0        1         2
1306       3         0    1      0      0        2         1
1307       3         0    1      0      0        2         1
1308       3         0    1      0      0        2         1

[1046 rows x 7 columns]

In [760]:
y = df2['pclass']
x = df2.drop('pclass',axis=1)

In [761]:
from sklearn import preprocessing
from sklearn.model_selection import train_test_split

# 독립변수, 종속변수 분리
y_t_df = y # 종속변수
X_t_df = x # 독립변수

# 독립변수 정규화
# X_t_df = preprocessing.StandardScaler().fit(X_t_df).transform(X_t_df)

# 학습용 데이터와 평가용 데이터를 8:2 혹은 7:3으로 분리
X_train, X_test, y_train, y_test = train_test_split(X_t_df, y_t_df, test_size = 0.2,
                                                   random_state = 8)

print(X_train.shape)
print(X_test.shape)

(836, 6)
(210, 6)

In [762]:
# 모델 학습 및 평가
from sklearn.metrics import accuracy_score
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier

rf_model = RandomForestClassifier()
rf_model.fit(X_train, y_train)
rf_pred = rf_model.predict(X_test)
accuracy_rf = accuracy_score(y_test, rf_pred).round(2)

lr_model = LogisticRegression()
lr_model.fit(X_train,y_train)
lr_pred = lr_model.predict(X_test)
accuracy_lr = accuracy_score(y_test,lr_pred).round(2)

print('rf 정확도:{}, lr 정확도:{}'.format(accuracy_rf,accuracy_lr))

rf 정확도:0.83, lr 정확도:0.87

## 모델 성능 개선 및 평가

### 데이터셋 개선을 위한 검토사항 예시
* 변수 = 'age_cat','male','female','fare_cat','family',{town_C','town_Q','town_S'}
* age의 Null 값을 평균값으로 대체하면 전체적인 데이터의 왜곡이 심함을 확인
* pclass는 fare_cat이랑 같이 모델에 넣을 경우 정확도가 떨어지고(0.82) 각각 넣었을 때는 fare_cat을 넣었을 때의 정확도가 더 높음(0.82, 3% 차이). 이상치에 가까울 정도로 요금이 높은 사람의 경우 사망률이 3클래스 승객과 비슷한 수치를 보이는 점이 pclass 변수에서는 반영이 되지 않았던 것이 원인으로 추측
* sex, embarked 변수로 집어넣은 것보다 원핫 인코더(dummies)로 처리해서 넣는 것이 정확도를 대략 5% 정도 높여주며 디시전 트리의 분기를 더 쉽게하는 효과 확인
* parch와 sibsp를 각각 변수에 적용하면  의미 있는 양상이 보이지 않고 정확도를 떨어뜨리지만 두 변수를 합쳐서 family라는 파생변수를 생성하면 생존율이 높은 여성 승객일지라도 가족 구성원 수가 많으면 생존율이 낮아지는 것을 확인

### 전처리 내역 예시
- age null 처리방법 변경 : 평균값 대체 > 삭제
- pclass와 fare_cat중 분석변수 선택
- embarked 원핫인코딩